perf-tests/results_new_20260420_151648/vertx/ab_customers_50k.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 5000 requests
Completed 10000 requests
Completed 15000 requests
Completed 20000 requests
Completed 25000 requests
Completed 30000 requests
Completed 35000 requests
Completed 40000 requests
Completed 45000 requests
Completed 50000 requests
Finished 50000 requests


Server Software:        
Server Hostname:        localhost
Server Port:            8083

Document Path:          /customers
Document Length:        745 bytes

Concurrency Level:      100
Time taken for tests:   2.303 seconds
Complete requests:      50000
Failed requests:        0
Total transferred:      40850000 bytes
HTML transferred:       37250000 bytes
Requests per second:    21706.90 [#/sec] (mean)
Time per request:       4.607 [ms] (mean)
Time per request:       0.046 [ms] (mean, across all concurrent requests)
Transfer rate:          17318.88 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   2.2      2      61
Processing:     1    3   3.7      2      62
Waiting:        1    3   3.5      2      62
Total:          1    5   4.2      4      63

Percentage of the requests served within a certain time (ms)
  50%      4
  66%      4
  75%      4
  80%      5
  90%      6
  95%      9
  98%     11
  99%     19
 100%     63 (longest request)