perf-tests/results_new_20260420_151648/vertx/hey_accounts_10k.txt

Summary:
  Total:	0.3867 secs
  Slowest:	0.0763 secs
  Fastest:	0.0001 secs
  Average:	0.0076 secs
  Requests/sec:	25857.5160
  
  Total data:	10460000 bytes
  Size/request:	1046 bytes

Response time histogram:
  0.000 [1]	|
  0.008 [8530]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.015 [460]	|■■
  0.023 [518]	|■■
  0.031 [173]	|■
  0.038 [88]	|
  0.046 [76]	|
  0.053 [90]	|
  0.061 [20]	|
  0.069 [19]	|
  0.076 [25]	|


Latency distribution:
  10%% in 0.0032 secs
  25%% in 0.0038 secs
  50%% in 0.0055 secs
  75%% in 0.0062 secs
  90%% in 0.0154 secs
  95%% in 0.0229 secs
  99%% in 0.0474 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0001 secs, 0.0000 secs, 0.0114 secs
  DNS-lookup:	0.0001 secs, 0.0000 secs, 0.0052 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0021 secs
  resp wait:	0.0072 secs, 0.0001 secs, 0.0762 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0014 secs

Status code distribution:
  [200]	10000 responses